#include <stdio.h>
#include <fcntl.h>
#include <string.h>
#include <stdlib.h>

#include <stdarg.h>
#include <sys/ioctl.h>

#include <errno.h>
#include <limits.h>
#include <unistd.h>

#include <linux/i2c.h>
#include <linux/i2c-dev.h>
#include <math.h>

#include "log.h"
#include "sysmon.h"
#include "bp_regs.h"
#include "sys_i2c.h"

#if 1   /* FIXME, martin, 2022.05.11 [BEGIN] */
#define IF_MIN_UNI_PORT_NUM     1
#define IF_MAX_UNI_PORT_NUM     24
#define IF_MIN_NNI_PORT_NUM     25
#define IF_MAX_NNI_PORT_NUM     28

#define IF_MIN_SLOT_NUM       1
#define IF_MAX_SLOT_NUM       1
#define IF_MIN_PORT_NUM       1
#define IF_MAX_PORT_NUM       PORT_ID_EAG6L_MAX
#define IF_AGGR_MAX_NUM       IF_TOTAL_NUM  /* 12 */
#define IF_AGGR_CLI_RANGE     "<1-12>"

#define HZ_I2C_SFP_INFO       128
#define HZ_I2C_SFP_DIAG       128

#define SFP_IIC_ADDR      0x50
#define DIAG_SFP_IIC_ADDR 0x51
#define CPLD_IIC_ADDR     0x55

#define I2C_MUX                    0x70
#if 1 /* [#84] Fixing for PM counters and I2C on Target system, dustin, 2024-07-30 */
#define I2C_MUX_100G_MASK          0x80 /* 100G port bit mask */
#else
#define I2C_MUX2                   0x71
#endif

#define SFP_INS1                   0x20
#define SFP_INS2                   0x21

int module_is_hisense;
int module_is_superxon;
int module_is_gpon;
#endif /* FIXME, martin, 2022.05.11 [END] */

#if 1/*[#54] Adding Smart T-SFP I2C functions, dustin, 2024-06-13 */
extern port_status_t PORT_STATUS[PORT_ID_EAG6L_MAX];
#endif
#if 1/* [#72] Adding omitted rtWDM related registers, dustin, 2024-06-27 */
extern u8 get_eag6L_dport(u8 lport);
#endif

typedef struct __raw_gbic_info__
{
    /// BASE ID FIELDS

    unsigned char   identifier;     // address 0
    unsigned char   ext_identifier;
    unsigned char   connector;
    unsigned char   transceiver[8];

    unsigned char   encoding;       // address 11
    unsigned char   br_nominal;
    unsigned char   resv1;
    unsigned char   length_km;
    unsigned char   length_100m;
    unsigned char   length_10m_50;
    unsigned char   length_10m_62_5;
    unsigned char   length_10m_copper;
    unsigned char   resv2;          // address 19

    unsigned char   vendor_name[ 16 ];
    unsigned char   resv3;
    unsigned char   vendor_oui[ 3 ];
    unsigned char   vendor_pn[ 16 ];
    unsigned char   vendor_rev[ 4 ];
    unsigned char   wavelength[ 2 ];
    unsigned char   resv4;
    unsigned char   CC_BASE;        // address 63

    // EXTENDED ID FIELDS

    unsigned char   options[ 2 ];
    unsigned char   br_max;
    unsigned char   br_min;
    unsigned char   vendor_sn[ 16 ];
    unsigned char   date_code[ 8 ];
    unsigned char   diagnostic_monitoring_type;
    unsigned char   enhanced_options;
    unsigned char   sff_8472_compliance;
    unsigned char   CC_EXT;

    // VENDOR SPECIFIC ID FIELDS

    unsigned char   vendor_specific[ 32 ];
}RawGbicInfo;

typedef struct __raw_gbic_diag_info__
{
  // Diagnostics: Data Fields - Address A2h

  // Alarm and Warning Thresholds
  unsigned char aw_thresholds[40];    // address 0
  unsigned char unallocated_16[16];

  // Calibration constants for External Calibration Option
  unsigned char ext_cal_constants[36];
  unsigned char unallocated_3[3];
  unsigned char cc_dmi;

  // A/D Values and Status Bits
  unsigned char diagnostics[10];        // byte 96~105 : temp, vcc, tx bias, tx/rx power
  unsigned char optional_diag[4];       // byte 106~109 : laser temp, tec curr
  unsigned char status_control;
  unsigned char reserved;

  // Alarm and Warning Flag Bits
  unsigned char alarm_flags[2];
  unsigned char tx_input_eq_control;
  unsigned char rx_out_emphasis_control;
  unsigned char warning_flags[2];

  // Extended Control/Status Memory Addresses
  unsigned char ext_status_control[2];

  // Vendor Specific Memory Addresses
  unsigned char vendor_specific[7];
  unsigned char table_select;

  // page 00-01h
  // User EEPROM
  unsigned char user_eeprom[120];	/*128-247*/

  // Vendor Control Function Addresses
    unsigned char vendor_control[8];	/*248-255*/
} RawGbicDiagInfo;

typedef struct __raw_qsfp28_lower_page_0__
{
	unsigned char	identifier;	/*0*/
	unsigned char	status[2];	/*1-2*/
	unsigned char	intr_flag[19];	/*3-21*/
	unsigned char	fs_dev_monitor[12];	/*22-33*/
	unsigned char	chann_monitor[48];	/*34-81*/
	unsigned char	reserved1[4];	/*82-85*/
	unsigned char	control[13];	/*86-98*/
	unsigned char	reserved2;	/*99*/
	unsigned char	fs_dev_chan_mask[5];	/*100-104*/
	unsigned char	vendor_specific[2];	/*105-106*/
	unsigned char	reserved3;	/*107*/
	unsigned char	fs_dev_property[3];	/*108-110*/
	unsigned char	pci_express[2];	/*111-112*/
	unsigned char	fs_dev_property2;	/*113*/
	unsigned char	reserved4[5];	/*114-118*/
	unsigned char	pwd_chg_entry[4];	/*119-122*/
	unsigned char	pwd_entry[4];	/*123-126*/
	unsigned char	page_select;	/*127*/
} RawQsfpLowerPage0;

typedef struct __raw_qsfp28_upper_page_0__
{
	unsigned char	identifier;	/*128*/
	unsigned char	ext_identifier;	/*129*/
	unsigned char	connector_type;	/*130*/
	unsigned char	spec_compliance[8];	/*131-138*/
	unsigned char	encoding;	/*139*/
	unsigned char	br_nominal;	/*140*/
	unsigned char	ext_rate_select;	/*141*/
	unsigned char	len_smf;	/*142*/
	unsigned char	len_om3_50um;	/*143*/
	unsigned char	len_om2_50um;	/*144*/
	unsigned char	len_om1_62dot5um;	/*145*/
	unsigned char	len_etc;	/*146*/
	unsigned char	dev_tech;	/*147*/
	unsigned char	vendor_name[16];	/*148-163*/
	unsigned char	ext_module;	/*164*/
	unsigned char	vendor_oui[3];	/*165-167*/
	unsigned char	vendor_pn[16];	/*168-183*/
	unsigned char	vendor_rev[2];	/*184-185*/
	unsigned char	wavelength[2];	/*186-187*/
	unsigned char	wl_tolerance[2];	/*188-189*/
	unsigned char	max_temp;	/*190*/
	unsigned char	cc_base;	/*191*/
	unsigned char	link_code;	/*192*/
	unsigned char	options[3];	/*193-195*/
	unsigned char	vendor_sn[16];	/*196-211*/
	unsigned char	date_code[8];	/*212-219*/
	unsigned char	diag_type;	/*220*/
	unsigned char	enhanced_option;	/*221*/
	unsigned char	br_nominal2;	/*222*/
	unsigned char	cc_ext;	/*223*/
	unsigned char	vendor_specific[32];	/*224-255*/
} RawQsfp28UpperPage0;

/* function declaration */
void i2c_set_sfp_channel_no(int bus, int portno);


void cprintf (const char *format, ...)
{
	int rc, fd;
	va_list args;

	char line[1024];
	va_start(args, format);
	rc = vsprintf(line, format, args);
	va_end(args);
	fd = open("/dev/console", O_RDWR, 0);
	write(fd, line, rc);
	close(fd);

	return;
}

typedef unsigned char uchar;
typedef unsigned char uint8_t;
typedef __u16 uint16_t;

typedef struct _slot_sfp_info_t           /* Maybe used to get SFP information in a slot */
{
	uchar   slot_num;   /* slot num to get SFP information */
	uint    port_stat;   /* port insertion status */
	uint    read_stat;   /* SFP port read status 1 = ok, 0 = not ok P8-P1 */
	uchar   data         [IF_MAX_PORT_NUM][HZ_I2C_SFP_INFO + HZ_I2C_SFP_DIAG]; /* SFP information + DDM field */
#if 1/* [#72] Adding omitted rtWDM related registers, dustin, 2024-06-27 */
